DylanRowe88/NukCPGDrop/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000

CONFIG_I2C_USE_DMA=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_DNS_CHECK_DOMAINS_REVERSE=n

CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# Use initial calibration data instead of full RF calibration.
# Full calibration requires real RF hardware and hangs in QEMU.
# The initial data from efuse is sufficient for normal operation.
CONFIG_ESP_PHY_CALIBRATION_MODE_INIT_DATA=y
